<?php
/**
 * 云店宝（扫码点餐）
 * Order Enum Data
 */
return [
    // fakepay模式（危险，全局订单只需支付0.01即可完成订单支付）
    'fakepay' => true,
    // 支付方式
    'pay_type' => [
        0 => '',
        1 => '储值支付',
        2 => '微信支付',
    ],
    //流水状态
    'statements_type' => [
        0 => '',
        1 => '收款',
        2 => '退款'
    ],
    //流水状态
    'statements_status' => [
        1 => '',
        2 => '已付款',
        3 => '已部分退款',
        4 => '已全部退款',
        10 => '已退款',
    ],
    //流水退款类型
    'statements_refund_type' => [
        0 => '',
        1 => '仅退款',
        2 => '退货退款',
    ],
    //流水渠道
    'statements_gateway' => [
        0 => '',
        1 => '现金',
        2 => '支付宝',
        3 => '微信',
        4 => '会员储值',
        5 => '微信(银行通道)',
        6 => '支付宝(银行通道)',
        7 => '刷卡消费',

    ],
    //流水渠道
    'statements_pay_source' => [
        0 => '',
        1 => '在线支付',
        2 => '收银台',
    ],
];
