<?php
/**
 * @Author: binghe
 * @Date:   2016-06-30 21:17:47
 * @Last Modified by:   binghe
 * @Last Modified time: 2017-12-06 11:00:11
 */
return array(
    'PWD'=>'/^[a-zA-Z0-9_~!@#$%^&*()]{8,25}$/',                                                 //密码
    'MAIL'=>"/\w+([-+.']\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/",                                   //邮箱
    'MOBILE'=>'/^(13|14|15|16|17|18|19)[0-9]{9}$/',                                             //手机号
    'IDS'=>'/^\d+(\,\d+)*$/',                                                                   //以逗号
    'IDCARD'=>'/^\d{17}[\d|X|x]|\d{15}$/',                                                      //身份证
    'ZCODE'=>'/^\d{6}$/',                                                                       //邮编
    'QQ'=>'/^\d{4,12}$/',                                                                       //QQ
    'PRICE'=>'/\d+(\.\d{1,2})?$/',                                                              //decimal 2
    'MONEY'=>'/\d+(\.\d{1,4})?$/',                                                              //decimal 4
    'LETTER'=>'/^[A-Za-z]+$/',                                                                  //字母
    'LETTERU'=>'/^[A-Z]+$/',                                                                    //大写字母
    'LETTERL'=>'/^[a-z]+$/',                                                                    //小写字母
    'LETTERNUM'=>'/^[A-Za-z0-9]/',                                                              //字母和数字
    'URL'=>"/^http(s)?:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/",   //地址
    'DATE'=>'/^\d{4}(\-|\/|\.)\d{1,2}\1\d{1,2}$/',                                              //日期
    'ID-NUM'=>'/^[0-9\,\-]+$/',                                                                 //以逗号隔开的id-num
    'NUM'=>'/^\d+$/',                                                                            //数字
    'VERSION'=>'/^\d+(\.\d+)*$/',
    );