<?php
/**
 * 外卖
 * Order Enum Data
 */
return [

    // // H5端Oauth登录
    // 'wx_oauth' => [
    //     'default' => [
    //         'APPID' => 'wxa5b6321e646b96e7',
    //         'APPSECRET' => '9b667c2c2d846f9a726ef6cb9a1ebbf4',
    //         // =======【curl代理设置】=======
    //         'CURL_PROXY_HOST' => '0.0.0.0',
    //         'CURL_PROXY_PORT' => 0,
    //     ],
    // ],

    // 文章中心分类
    'article_cate' => [
        1 => '新手上路',
        2 => '企业公告',
        3 => '产品动态',
    ],

    // 支付方式
    'pay_type' => [
        0 => '',
        1 => '储值支付',
        2 => '微信支付',
        // 3 => '支付宝',
    ],

    // 配送方式
    'logistics_type' => [
        0 => '',
        1 => '门店配送',
        2 => '达达配送',
        3 => '点我达配送',
        4 => '到店自提',
        5 => '风达配送',
        6 => '餐厅宝配送',
    ],

    // 发货方式
    'send_type' => [
        0 => '',
        1 => '门店配送',
        2 => '达达配送',
        3 => '点我达配送',
        4 => '到店自提',
        5 => '风达配送',
        6 => '餐厅宝配送',
    ],

    // 售后状态 1待商家审核 -1买家撤销 -9商家拒绝 2商家同意 9售后关闭(预留）
    'afs_status' => [
        -1 => '买家撤销',
        -9 => '商家拒绝',
        1 => '待商家审核',
        2 => '商家同意',
        9 => '售后关闭',
    ],

    // 限时折扣 优惠方式
    'discount_type' => [
        1 => '打折',
        2 => '减价',
    ],

    // 促销活动状态
    'promotion_status' => [
        1 => '未开始',
        2 => '进行中',
        3 => '已结束',
    ],

    // 优惠券状态
    'coupon_status' => [
        1 => '待使用',
        2 => '已使用',
        3 => '已过期',
    ],

    // 达达物流状态
    'dada_status' => [
        '1' => '商家备货中',
        '2' => '骑手赶往商家',
        '3' => '旗手配送中',
        '4' => '配送完成',
        '5' => '已取消',
        '7' => '已过期',
        '8' => '指派单',
        '9' => '妥投异常之物品返回中',
        '10' => '妥投异常之物品返回完成',
        '1000' => '创建达达运单失败',
    ],

    // 点我达物流状态
    'dianwoda_status' => [
        '0' => '派单中',
        '3' => '已转单',
        '5' => '取餐中',
        '10' => '已到店',
        '15' => '配送中',
        '100' => '已完成',
        '98' => '异常',
        '99' => '已取消',
    ],

    // 点我达物流状态
    'fengda_status' => [
        '1' => '待取货',
        '2' => '已取货',
        '3' => '已送达',
        '4' => '未接单',
        '5' => '异常',
    ],

    // 餐厅宝物流状态
    'cantingbao_status' => [
        '0' => '未接单',
        '1' => '已处理',
        '21' => '派单中',
        '22' => '已接单',
        '23' => '已取餐',
        '100' => '同意退款',
        '101' => '拒绝退款',
        '254' => '已完成',
        '255' => '已关闭',
    ],


    //商品单位类型
    'goods_unit_type'=>[
        0=>'件',
        1=>'kg',
        2=>'g',
        3=>'千克',
        4=>'克',
        5=>'斤',
        6=>'两'
    ]

];
